// ローカルは下記で実行
// -------------------------------------------------------------
// const input = require("fs")
//   .readFileSync("./input.txt", "utf8")
//   .trim()
//   .split("\n");

// 本番は下記で提出
// -------------------------------------------------------------
const input = require("fs")
  .readFileSync("/dev/stdin", "utf8")
  .trim()
  .split("\n");

// -------------------------------------------------------------

// [memo]かかった時間:35分
// 算数的に全然会わなかった。。とにかく、一番単純なパターンを考え、まずはそれを出力する（今回ならNが十分大きいとき）ことから考える
// そしてそれ以降はそっから帳尻を合わせるということを再度肝に銘じる

// 以降処理記載
const [n, k, a] = input[0].split(" ").map((str) => Number(str));
let output = (a + k - 1) % n;
if (output === 0) {
  output = n;
}
console.log(output);
